Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpression Constructor (BooleanFilterExpression, BooleanOperatorType, BooleanConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BinaryFilterExpression(
	BooleanFilterExpression Left,
	BooleanOperatorType Oper,
	BooleanConstantFilterExpression Right
)
Public Sub New (
	Left As BooleanFilterExpression,
	Oper As BooleanOperatorType,
	Right As BooleanConstantFilterExpression
)
Parameters
Left
Type: Tekla.Structures.Filtering.BooleanFilterExpression
The left operand of the filter expression.
Oper
Type: Tekla.Structures.Filtering.BooleanOperatorType
The operator of the filter expression.
Right
Type: Tekla.Structures.Filtering.BooleanConstantFilterExpression
The right operand of the filter expression.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a null filter expression is specified.
See Also
Reference
BinaryFilterExpression Class
BinaryFilterExpression Overload
Tekla.Structures.Filtering Namespace